/*********************************************************************************************************
* 模块名称: App.c
* 摘    要: 
* 当前版本: 
* 作    者: 
* 完成日期: 
* 内    容:
* 注    意:                                                                   
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include "DataType.h"
#include "PackUnpack.h"
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void PrintfDataAfterPack(u8* pData);
static void PrintfDataAfterUnpack(u8* pData, i16 packLen);
/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
static void PrintfDataAfterPack(u8* pData)
{
	static u8 s_iCnt = 1;
	i16 i;

	printf("Packet NO.%d after packing:\n", s_iCnt);
	s_iCnt++;

	for (i = 0; i < 10; i++)
	{
		printf("pData[%d]=%x\n", i, pData[i]);
	}
}
static void PrintfDataAfterUnpack(u8* pData, i16 packLen)
{
	static u8 s_iCnt = 1;
	i16 i;

	printf("Data NO.%d after unpacking:\n", s_iCnt);
	s_iCnt++;

	for (i = 0; i < packLen; i++)
	{
		printf("pData[%d]=%x\n", i, pData[i]);
	}
}
/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
void main(void)
{
	u8 i;
	u8 packGot;

	StructPackType ptDataBeforePack1;
	StructPackType ptDataBeforePack2;

	u8 arrDataBeforeUnpack[100] = {0x70,0xa0,0x82,0x92,0xb4,0xd6,0xf8,0x90,0x80,0xb6,
	                               0x22,0x41,0x71,0xa0,
	                               0x82,0x92,0xb3,0xd5,0xf7,0x99,0x80,0xbc};

	StructPackType ptDataAfterUnPack;

	InitPackUnpack();


}
