/*********************************************************************************************************
* 模块名称: App.c
* 摘    要: 
* 当前版本: 
* 作    者: 
* 完成日期: 
* 内    容:
* 注    意:                                                                   
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include <stdio.h>
#include <Windows.h>
#pragma comment(lib,"winmm.lib")

#include "DataType.h"
#include "RunClock.h"
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void InitSoftware(void);

static void __stdcall TimeProc(unsigned int uTimerID, unsigned int uMsg, unsigned long dwUser, unsigned long dw1, unsigned long dw2);

static void Proc2msTask(void);
static void Proc1SecTask(void);


/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: 
* 函数功能: 
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 
* 注    意: 
*********************************************************************************************************/
static void InitSoftware(void)
{
	InitRunClock();

	SetTimeVal(TIME_VAL_HOUR,23);
	SetTimeVal(TIME_VAL_MIN, 59);
	SetTimeVal(TIME_VAL_SEC, 49);
}

static void __stdcall TimeProc(unsigned int uTimerID, unsigned int uMsg, unsigned long dwUser, unsigned long dw1, unsigned long dw2)
{
	Proc2msTask();
}


static void Proc2msTask(void)
{
	static short s_iCnt500 = 0;

	RunClockPer2Ms();

	if (s_iCnt500 >= 499)
	{
		Proc1SecTask();
		s_iCnt500 = 0;
	}
	else
	{
		s_iCnt500++;
	}
}

static void Proc1SecTask(void)
{
	DispTime(GetTimeVal(TIME_VAL_HOUR), GetTimeVal(TIME_VAL_MIN), GetTimeVal(TIME_VAL_SEC));
}
/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: 
* 函数功能: 
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 
* 注    意: 
*********************************************************************************************************/
void main(void)
{
	InitSoftware();

	timeSetEvent(2, 1, TimeProc, 0, TIME_PERIODIC);

	while (1)
	{

	}
}
